nxp-mcuxpresso/mcuxsdk-examples/_boards/mcimx93evk/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitNETQOSPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitNETQOSPins(void) {                          /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_MDC__ENET_QOS_MDC, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_MDC__ENET_QOS_MDC, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_MDIO__ENET_QOS_MDIO, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_MDIO__ENET_QOS_MDIO, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RD0__ENET_QOS_RGMII_RD0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RD0__ENET_QOS_RGMII_RD0, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RD1__ENET_QOS_RGMII_RD1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RD1__ENET_QOS_RGMII_RD1, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RD2__ENET_QOS_RGMII_RD2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RD2__ENET_QOS_RGMII_RD2, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RD3__ENET_QOS_RGMII_RD3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RD3__ENET_QOS_RGMII_RD3, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RXC__CCM_ENET_QOS_CLOCK_GENERATE_RX_CLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RXC__CCM_ENET_QOS_CLOCK_GENERATE_RX_CLK, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(3U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RX_CTL__ENET_QOS_RGMII_RX_CTL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RX_CTL__ENET_QOS_RGMII_RX_CTL, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TD0__ENET_QOS_RGMII_TD0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TD0__ENET_QOS_RGMII_TD0, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TD1__ENET_QOS_RGMII_TD1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TD1__ENET_QOS_RGMII_TD1, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TD2__ENET_QOS_RGMII_TD2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TD2__ENET_QOS_RGMII_TD2, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TD3__ENET_QOS_RGMII_TD3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TD3__ENET_QOS_RGMII_TD3, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TXC__CCM_ENET_QOS_CLOCK_GENERATE_TX_CLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TXC__CCM_ENET_QOS_CLOCK_GENERATE_TX_CLK, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(3U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TX_CTL__ENET_QOS_RGMII_TX_CTL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TX_CTL__ENET_QOS_RGMII_TX_CTL, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U));
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIOPins:
- options: {callFromInitBoot: 'false', coreID: cm33}
- pin_list:
  - {pin_num: K20, peripheral: FLEXIO1, signal: 'flexio_flexio, 02', pin_signal: GPIO_IO02, SION: ENABLED, OD: ENABLED, PD: DISABLED}
  - {pin_num: K21, peripheral: FLEXIO1, signal: 'flexio_flexio, 03', pin_signal: GPIO_IO03, SION: ENABLED, OD: ENABLED, PD: DISABLED, DSE: X4}
  - {pin_num: L17, peripheral: FLEXIO1, signal: 'flexio_flexio, 04', pin_signal: GPIO_IO04, SION: ENABLED, OD: DISABLED, PD: DISABLED}
  - {pin_num: L18, peripheral: FLEXIO1, signal: 'flexio_flexio, 05', pin_signal: GPIO_IO05, PD: DISABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIOPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLEXIOPins(void) {                          /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO02__FLEXIO1_FLEXIO02, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO02__FLEXIO1_FLEXIO02, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO03__FLEXIO1_FLEXIO03, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO03__FLEXIO1_FLEXIO03, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO04__FLEXIO1_FLEXIO04, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO04__FLEXIO1_FLEXIO04, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO05__FLEXIO1_FLEXIO05, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO05__FLEXIO1_FLEXIO05, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
}


